Repository: Jinxed-Liu/esheep
Catalog: eSheepNext/Localizable.xcstrings
Source language: zh_hans
Languages: en

source: 更新牧场固定位置
en: Update ranger stationary position

source: 更新配方组成
en: Update formulation composition

source: 替代记录
en: Alternative record

source: 月出
en: Moonrise

source: 月度产羔
en: ♪ The moon gives birth ♪

source: 月度断奶
en: Moon weaning.

source: 月相
en: Moon.

source: 月落
en: Moondown

source: 有 %lld 条本地记录等待同步
en: %lld local records waiting to sync

source: 有 %lld 胎缺少胎次、死胎数或逐只羔羊明细，仅不纳入需要这些字段的指标；胎间距和产后天数仍按产羔日期计算。
en: %lld lambings are missing parity, stillbirth, or per-lamb details. They are excluded only from metrics that need those fields; interval and postpartum days still use lambing dates.

source: 有 %lld 胎缺少胎次、死胎数或逐只羔羊明细，未纳入对应指标。
en: %lld lambings are missing parity, stillbirth, or per-lamb details and are excluded from the relevant metrics.

source: 有待处理的数据冲突
en: Data conflicts need attention

source: 有效
en: Valid.

source: 有效剩料组成
en: Active residue composition

source: 有效圈舍
en: Valid pen

source: 有效期
en: Validity period

source: 有效期至
en: Valid until

source: 有效期至 %@
en: Valid until %@

# 有效照片 %@ 张 · 云端资产 %@ 份
source: 有效照片 %1$@ 张 · 云端资产 %2$@ 份
en: Valid photos %@ pieces · Cloud assets %@ copies

# 有效照片 %@ 张 · 云端资产 %@ 份（含 %@ 份删除历史）
source: 有效照片 %1$@ 张 · 云端资产 %2$@ 份（含 %3$@ 份删除历史）
en: Valid photos %@ pieces · Cloud assets %@ copies (including %@ copies of delete history)

source: 有效羊只
en: A valid sheep.

source: 有效羊数
en: Effective number of sheep

source: 有效配方
en: A valid formulation

source: 有羊圈舍
en: There are sheep pen

source: 服务商
en: Service provider

source: 服务条款
en: Service terms

source: 服务版本
en: Service version

source: 服务端 Revision
en: Service Review

source: 服务端只保存 SHA-256；该 256 位随机邀请码只能兑换一次。
en: The server only saves SHA-256; the 256-bit random invitation code can only be redeemed once.

source: 期初库存
en: Opening inventory

source: 木质素
en: Wood

source: 未使用
en: Unused

source: 未关联
en: Not associated

source: 未关联供体
en: Unconnected Supply

source: 未关联对象
en: Other Organiser

source: 未关联羊只
en: Not associated with sheep.

source: 未分圈
en: Not circled

source: 未分类
en: Unclassified

source: 未匹配
en: Not matched

source: 未启用
en: Not enabled

source: 未启用时仍可在监控页查看目标、实际和差值，但不会自动生成未投喂、偏低或偏高提醒。
en: When not enabled, goals, actuals, and deviations can still be viewed on the monitoring page, but no unfeed, low, or high alerts are automatically generated.

source: 未命名
en: Unnamed

source: 未命名地点
en: Unnamed Location

source: 未命名批次
en: Unnamed Batch

source: 未命名操作
en: Unnamed Operation

source: 未命名配种方案
en: Unnamed setup

source: 未填写
en: Unfilled

source: 未填写品种
en: Unfilled species

source: 未填写的参数会保持缺失，不按 0 参与营养计算。
en: Missing parameters will remain missing and do not participate in the nutrition calculation by 0.

source: 未建档
en: Unset

source: 未开启
en: Off

source: 未录入
en: Unrecorded

source: 未扣除
en: Not deducted

source: 未找到
en: Not found

source: 未找到可修正的 TMR 投喂记录。
en: No TMR feeding record is available for correction.

source: 未找到可修正的原始记录。
en: No original record was found that could be amended.

source: 未找到可恢复的离场记录。
en: No recoverable exit records were found.

source: 未找到可用的 TMR 批次。
en: No available TMR batch found.

source: 未找到可用的 TMR 投喂计划。
en: No available TMR feeding scheme found.

source: 未找到可用的 TMR 配方。
en: No available TMR formulation found.

source: 未找到可结束的批次成员关系。
en: No ending batch membership was found.

source: 未找到已完成的 TMR 顿次。
en: No completed TMR meal was found.

source: 未找到当前牧场中的冻精供体。
en: Frozen concentrates from current rangelands were not found.

source: 未找到当前牧场中的圈舍。
en: No ring in the current rangeland was found.

source: 未找到当前牧场中的库存批次。
en: No batches of current stock in rangelands were found.

source: 未找到当前牧场中的生产批次。
en: No batches of current rangeland production were found.

source: 未找到当前牧场中的羊只。
en: No sheep were found in the current range.

source: 未找到要切换的牧场。
en: No range has been found to switch.

source: 未找到这只母羊此前可关联的配种记录。
en: No records were found of the sheep's previous associated species.

source: 未投喂
en: No feed.

source: 未来 7 天
en: Future 7 days

source: 未来 24 小时
en: Future 24 hours

source: 未标注
en: Unmarked

source: 未清理：%@
en: Cleanup did not run: %@

source: 未用 0 项掩盖错误，请重试。
en: No item 0 is used to hide the error. Please try again.

source: 未知
en: Unknown

source: 未知供体
en: Unknown supplier

source: 未知冻精批次
en: Unknown frozen batch

source: 未知原料
en: Unknown raw material

source: 未知圈舍
en: Unknown Circle

source: 未知或使用冻精
en: Unknown or frozen

source: 未知批次
en: Unknown batch

source: 未知母羊
en: Unknown Sheep

source: 未知羊只
en: Unknown sheep

source: 未知错误
en: Unknown error

source: 未确认
en: Not confirmed

source: 未获得可用的 Apple 账户凭据。
en: No usable Apple account credential was received.

source: 未获得当前位置权限。您仍可通过搜索地点或手动填写坐标保存牧场位置。
en: Location permission was not granted. You can still save the farm location by searching for a place or entering coordinates manually.

source: 未获得提醒事项权限，未创建提醒。
en: Reminders permission was not granted, so no reminder was created.

source: 未获得日历写入权限，未创建事件。
en: Calendar write access was not granted, so no event was created.

source: 未获得麦克风权限。
en: No microphone access was granted.

source: 未计算
en: Not calculated

source: 未订阅
en: Unsubscribed

source: 未记录
en: Not Recorded

source: 未记录拍摄时间，当前显示添加时间
en: The shooting time is not recorded and the added time is currently displayed.

source: 未记录料槽原料组成
en: Unrecorded raw material composition

source: 未记录耳号
en: Unrecorded ear marks

source: 未设置圈舍
en: No Circle set

source: 未识别
en: Not recognized

source: 未选原料
en: Unselected raw materials

source: 未选择
en: Not selected

source: 未配置
en: Not configured

source: 本临时迁移结果可进入人工验收。正式牧场、云端和旧版数据均未写入。
en: This temporary migration result is ready for manual acceptance. No writes were made to the production farm, cloud, or legacy data.

source: 本交父本必须是已标记的种公羊。
en: The parent must have been a marked species of ram.

source: 本交种公羊与冻精必须二选一。
en: It's important to have a choice between a male and a male.

source: 本地健康记录
en: Local health records

source: 本地可用，云同步已暂停
en: Locally available, cloud sync has been suspended

source: 本地存储
en: Local storage

source: 本地恢复断点与当前云端牧场不一致。
en: Local restoration of breakpoints is not consistent with current cloud pastures.

source: 本地投喂记录
en: Local feed record

source: 本地投影修复后仍与已校验 staging 不一致。
en: Local projection recovery is still not consistent with verified status.

source: 本地投影修复的 staging 路径不匹配。
en: The local projection fixes do not match the status path.

source: 本地数据暂时无法打开
en: Local data temporarily cannot be opened

source: 本地校验完成
en: Local validation complete

source: 本地照片记录不存在。
en: Local photo records do not exist.

source: 本地牧场与未同步记录仍然保留。
en: Local farms and unsynced records are retained.

source: 本地羊只与圈舍档案
en: The local sheep are only in the circle files.

source: 本地羊只档案
en: Local sheep files.

source: 本地羊只集合与已校验 staging 不一致，拒绝执行投影修复。
en: Local flocks are not consistent with verified status and refuse to perform projection repair.

source: 本地记录可继续使用，云同步已暂停。
en: Local records remain available; cloud sync is paused.

source: 本地记录已保留，重新登录后恢复同步
en: Local records kept and synchronized after re-entry

source: 本地记录已排队处理
en: Local records are queued

source: 本地记录待同步
en: Local records to be synchronized

source: 本场关联
en: Related to this field

source: 本场实测日增重
en: Actual daily weight gain measured in this session

source: 本场种公羊
en: Farm Breeding Ram

source: 本场种公羊与冻精必须二选一；普通公羊不会出现在此处。
en: You must choose one of the two types ram and frozen semen in this field; the ordinary ram will not appear here.

source: 本场种公羊和冻精供体必须二选一；供体关联种公羊只能由供体关系投影。
en: There must be one choice between the species of sheep and the frozen concentrate; the species of sheep associated with the supply can only be projected by the supply relationship.

source: 本对话只读取和操作该牧场的数据
en: This dialog only reads and operates the data of the farm

source: 本批全部羊只合计的大于零售卖金额
en: The total amount of sheep in this shipment is only greater than the retail amount.

source: 本批出售备注，可为空
en: Notes for sale in this instalment

source: 本批投入重量 kg
en: The input weight of this batch is kg

# 本批次配方修订 v%lld，计划快照 v%lld；同一配方可计入，但请核对版本差异。
source: 本批次配方修订 v%1$lld，计划快照 v%2$lld；同一配方可计入，但请核对版本差异。
en: This batch formula is revised v %lld, and the planned snapshot v %lld; the same formula can be included, but please check the version difference.

source: 本月投喂
en: This month, it's for you.

source: 本期结束
en: End of this period

source: 本机 Outbox 与已上云的同 operationID 操作内容不一致。
en: This Outlook does not correspond to the same operational content of the cloud.

source: 本机 Tombstone 语义
en: Local Tombstone Semantic

source: 本机 Tombstone 阻塞项缺少唯一 Operation、Tombstone、签名或 Outbox 证据，已停止自动修复。
en: The Tombstone blocking item has ceased to be automatically repaired without the sole evidence of Operation, Tombstone, signature or Outlook.

source: 本机已有同 ID 牧场，已停止覆盖。
en: This machine already has the same ID range, which has stopped covering.

source: 本机操作与云端同 operationID 的不可变内容不一致。
en: This operation is not consistent with the non-variable content of the cloud end of the projectID.

source: 本机数据可离线使用；云端同步依赖 Supabase 和网络服务。同步故障不会被描述为保存成功，应用会保留待处理状态。
en: This machine data can be used offline; cloud synchronised depends on Supabese and web services. Synchronization failure will not be described as a success in saving, and applications will retain their status.

source: 本机登录会话不存在，请重新登录。
en: This log-in session does not exist, please re-enter.

source: 本机缺少可与云端根记录逐项核对的 v2 基线身份。
en: This machine lacks a v2 baseline identity that can be cross-checked with cloud root records.

source: 本次 TMR 操作包含重复标识，已停止保存。
en: This TMR operation contains a duplicate identifier and has stopped saving.

source: 本次产羔胎次
en: Parity for this lambing

source: 本次修改会形成循环系谱，已停止保存。
en: This modification will form a circular spectrum and has been discontinued.

source: 本次回答或操作草案超过 MiMo 单次输出长度，已无法完整生成。请缩小范围后重试。
en: This answer or draft operation exceeds MiMo 's single output length and cannot be fully generated. Please try again after narrowing the scope.

source: 本次实际合计
en: The actual total this time

source: 本次总量
en: The total amount this time

source: 本次没有出生45日内且尚未断奶的推荐羊只。
en: There is no recommended sheep for those who were born within 45 days and have not yet weaning this time.

source: 本次直接投料总量
en: The total amount of direct input this time

source: 本次胎次会与后续产羔记录冲突
en: This birth is going to be in conflict with the next child record.

source: 本次追加涉及已手工完成的圈舍顿次。确认后，重新打开与追加投料会作为同一个原子操作保存。
en: This addition affects a pen feeding that was completed manually. After confirmation, reopening the feeding and adding feed are saved as one atomic operation.

source: 本次邀请
en: This invitation

source: 本组后代
en: Offspring in this group

source: 本羊
en: My sheep.

source: 本胎备注
en: Note to this place

source: 本轮批量确认已完成
en: This round of batch confirmation has been completed

source: 本锅原料必须与所选 TMR 配方的原料组成一致。
en: This boiler material must be in line with the composition of the selection of the TMR formulation.

source: 本锅建议量
en: Recommended amount for this batch

source: 本锅总量
en: Total in this pot

source: 本锅来源
en: Source for this batch

source: 本锅计划总量
en: Planned total for this batch

source: 本阶段只允许星露谷测试牧场执行非空 Supabase 启云。
en: At this stage, only Supabase clouds are allowed to test the rangelands.

source: 本阶段只开放星露谷测试牧场的非空启云。
en: At this stage, only the non-space-enlighted clouds of the rangelands are open for test in the Star-Live Valley.

source: 权威口径
en: Authoritative caliber

source: 权威操作
en: Authoritative Actions

source: 权威缓存已经切换完成；这里只重建增量同步引擎，不会重新下载整座牧场。
en: The authoritative cache has been switched; only the incremental sync engine is rebuilt here, and the entire farm will not be re-downloaded.

source: 权限
en: Permissions

source: 权限拒绝
en: Permission denied

source: 杜泊
en: Topo!

source: 杜泊供体01
en: Doppler 01

source: 杜湖杂交
en: Du-Lake mixed.

source: 条
en: Article

source: 条款、隐私与数据使用说明
en: Terms, privacy, and data-use information

source: 条款、隐私和境外告知版本：%@。同意时间、App 版本和语言会被记录用于证明你的选择。
en: Terms, privacy, and cross-border notice version: %@. The consent time, app version, and language are recorded as evidence of your choice.

source: 来源
en: Source

source: 来源 JSON
en: Source JSON

source: 来源：%@
en: Source: %@

source: 来源：eSheep 云 · 业务记录 %lld · 照片 %lld
en: Source: eSheep Cloud · Records %lld · Photos %lld

source: 来源：仅本机 · 业务记录 %lld · 照片 %lld
en: Source: On-device only · Records %lld · Photos %lld

# 来源：已停用的旧云备份 · 业务记录 %lld · 照片 %lld
source: 来源：已停用的旧云备份 · 业务记录 %1$lld · 照片 %2$lld
en: Source: Retired legacy cloud backup · Business records %lld · Photos %lld

source: 来源（可选）
en: Source (optional)

source: 来源审计
en: Source audit

source: 来源审计（%lld）
en: Source audit (%lld)

source: 来源校验
en: Source verification

source: 来源牧场
en: Source farm

source: 来源记录
en: Source record

source: 来自 eSheepPlus 系统原料库；加入后保存独立营养快照。
en: From the raw material bank of the eSheepPlus system; independent nutritional snapshots maintained after addition.

source: 极端预警
en: Extreme early warning

source: 松开结束录音
en: Release to end recording

source: 查找耳号 001 的羊并总结档案
en: Find sheep with ear 001 and summarize the files.

source: 查看 AI 数据处理说明
en: View AI Data Processing Notice

source: 查看、筛选和导出牧场历史
en: View, filter, and export farm history

source: 查看${applicationName}今日任务
en: View today’s tasks in ${applicationName}

source: 查看今日任务
en: View today's tasks

source: 查看到期待办和业务异常
en: View due tasks and production exceptions

source: 查看境外提供个人信息告知
en: View Cross-Border Personal Information Transfer Notice

source: 查看或更换头像
en: View or replace the image

source: 查看批次、余量和有效期
en: View batches, remaining stock, and expiry dates

source: 查看批次详情
en: View details of batch

source: 查看指定牧场今日生产摘要与待同步操作。
en: View today's production summary and pending sync actions for the specified farm.

source: 查看接收方、数据种类、风险和撤回方式
en: View Recipient, Data Categories, Risks, and Withdrawal Options

source: 查看牧场成员
en: Check for rangers

source: 查看羊只档案、体重与时间线
en: Check the sheep files, weight and timeline.

source: 查看羊只照片大图
en: View large picture of sheep photo

source: 查看迁移技术明细
en: View migration technology breakdown

source: 查看通知设置
en: View Notification Settings

source: 查询官方额度
en: Check the official quota

source: 标准回推日
en: Standard push back date

source: 标准模式
en: Standard Mode

source: 标称每袋/捆重量 kg（说明）
en: Nominal weight per bag/bundle kg (description)

source: 标记为无效
en: Mark as invalid

source: 标记无效时必须填写原因。
en: The reason must be given when the mark is invalid.

source: 标记种公羊
en: Marked rams

source: 校准预期日增重
en: Calibrate expected daily weight gain

source: 校验完成，正在准备显示牧场
en: Validation complete. Preparing to display pasture.

source: 校验完成后才会切换到 eSheep 云
en: Switch to eSheep Cloud only after verification

source: 校验完整摘要
en: Verify full summary

source: 校验问题
en: Verification problem

source: 样本范围
en: Sample range

source: 核对 Tombstone 权威（%lld）
en: Check Tombstone authority (%lld)

source: 核对产羔本后确认
en: Check and confirm.

# 核对出生前 %lld～%lld 天内与母羊同舍且在场的种公羊。早产容差候选会明确标注；Core ML 只参与排序，点击候选不会立即确权。
source: 核对出生前 %1$lld～%2$lld 天内与母羊同舍且在场的种公羊。早产容差候选会明确标注；Core ML 只参与排序，点击候选不会立即确权。
en: Check breeding rams that were present in the same pen as the ewe %lld–%lld days before birth. Candidates in the premature-birth tolerance window are clearly marked. Core ML only ranks candidates; tapping one does not confirm the sire.

source: 核对历史同舍
en: Check history.

source: 核对历史配种圈舍，批量确认唯一父本
en: Check the historical speculator and confirm the sole parent in bulk

source: 核对当前牧场的 Operation 与 Tombstone；只有签名验证通过才会修正本地投影或云端签名索引，无法证明一致时不会覆盖权威数据。
en: Check the Operation and Tombstone of the current farm; only when the signature verification is passed will the local projection or cloud signature index be corrected, and the authoritative data will not be overwritten when the consistency cannot be proved.

source: 核对结果
en: Check results

source: 核心系谱
en: Core pedigree

source: 根据 get_farm_action_schema 返回的格式生成牧场操作草案。payload_json 必须是该格式的 JSON 字符串；风险、权限和命令类型由 App 本地重新计算。模型绝不能直接执行。
en: Generate a draft ranger operation according to the format that gets farm action schema returns. Payload json must be a JSON string in this format; risks, privileges and command types are recalculated locally by App. Models must not be implemented directly.

source: 档案
en: Archives

source: 档案确认当前胎次
en: File confirms the current birth date

source: 检查并处理加入申请
en: Check and process membership applications

source: 检查并确认
en: Check and confirm.

source: 检查批准状态并加入
en: Check approval status and join

source: 检查操作草案
en: Check the action draft

source: 检查旧副本并清理
en: Check for old copies and clean up

source: 检查清理范围
en: Check the cleaning scope

source: 检查点
en: Checkpoints

source: 检测到不可变云端操作被硬删除，已锁定本地缓存并要求按 ready 根记录完整重建。
en: Unchangeable cloud operations have been detected to be hard deleted, local caches have been locked and complete reconstruction is required by the ready root record.

source: 检测到未通过签名操作修改牧场根记录，未覆盖本地牧场资料。
en: No changes in the root records of rangelands were detected through signature operations, and no local rangeland information was covered.

source: 模型
en: Model

source: 模型由输入类型自动切换，不开放自定义模型或第三方地址。
en: The model is automatically switched by the input type, and no custom models or third-party addresses are allowed.

source: 模型请求了未授权的工具。
en: The model requests unauthorized tools.

source: 模型请求由此 iPhone 直接发往 MiMo，eSheep 服务端不接触明文 Key。
en: The model requests that the iPhone be sent directly to Mimo, eSheep service without explicit contact with Key.

source: 模板导出失败：%@
en: Template export failed: %@

source: 模板生成失败：%@
en: Template generation failed: %@

source: 模糊
en: Blur

source: 横向滑动查看更多列
en: Swipe horizontally to see more columns

source: 横图
en: Tiles

source: 横图照片
en: Diagram Photo

source: 次
en: Minor

source: 正在上传迁移数据
en: Uploading migration data

source: 正在下载检查点
en: Downloading Checkpoint

source: 正在下载照片
en: Downloading photos

source: 正在保存
en: Saving

source: 正在保存离场记录
en: Saving departure record

source: 正在写入并校准羊群历史…
en: Writing and calibrating flock history...

source: 正在准备
en: I'm getting ready.

source: 正在准备分析
en: Preparing for analysis

source: 正在准备当前牧场的搜索索引…
en: Preparing search index for current farm...

source: 正在准备成员共享，完成后即可发送邀请
en: Preparing for member sharing, invitations can be sent once completed

source: 正在准备海报
en: Preparing poster

source: 正在准备筛选数据
en: Preparing to filter data

source: 正在切换本地数据库
en: Switching local database

source: 正在切换本地缓存
en: Switching local caches

source: 正在创建正式牧场
en: Creating formal pastures

source: 正在创建账号
en: Creating account

source: 正在创建邀请…
en: Creating invitation…

source: 正在加入 · %@
en: Joining · %@

source: 正在加入…
en: Joining…

source: 正在加入共享牧场
en: Joining sharing farm

source: 正在加入共享牧场 · %@
en: Joining shared farm · %@

source: 正在加载照片
en: Loading photos

source: 正在发现云端牧场
en: We're looking at cloudy pastures.

source: 正在发送…
en: Sending...

source: 正在同步
en: Currently sync

source: 正在同步删除
en: Sync delete in progress

source: 正在同步头像
en: Now sync avatar

source: 正在同步并生成备份…
en: Sync and generating backup…

source: 正在后台准备分析数据…
en: Preparing data analysis backstage...

source: 正在后台核对业务事实与逾期日程。
en: Business facts and overdue schedules are being checked in the background.

source: 正在后台验证
en: is being verified in the background

source: 正在后台验证，不影响本地牧场使用。
en: Validation is under way backstage, without prejudice to local rangeland use.

source: 正在后台验证登录状态
en: Verifying login status in background

source: 正在启用 eSheep 云…
en: Enable eSheep clouds...

source: 正在处理照片
en: Processing photos

source: 正在安全切换到共享牧场资料
en: Switching safely to shared ranger data.

source: 正在安全迁移
en: We're moving safely.

source: 正在寻找邀请
en: Looking for an invitation

source: 正在建立临时牧场
en: Creating temporary farm

source: 正在建立仅供本次邀请使用的加密连接。
en: Creating an encrypted connection for this invitation only.

source: 正在建立安全下载通道
en: Establishing a secure download channel

source: 正在建立安全连接
en: Establishing a secure connection

source: 正在建立系谱索引
en: Creating pedigree index

source: 正在录音，%@，松开结束
en: Recording, %@, release to end

source: 正在恢复云端牧场
en: Restore cloud farm

source: 正在打开%@。
en: Opening %@.

# 正在打开%@的%@。
source: 正在打开%1$@的%2$@。
en: Opening %@ for %@.

source: 正在打开%@的羊只搜索。
en: Opening sheep search for %@.

source: 正在拉取云端记录
en: Ripping cloud records

source: 正在推算
en: Computing

source: 正在搜索
en: Searching

source: 正在搜索地点
en: Searching for places

source: 正在整理事件记录
en: Organizing event records

source: 正在整理今日投喂
en: Organizing today's feeding

source: 正在整理可导出的记录
en: Organizing exportable records

source: 正在整理圈舍
en: Organizing Pens…

source: 正在整理投喂历史
en: Organizing feeding history

source: 正在整理羊只
en: Sorting out sheep

source: 正在更新分析
en: Updating analysis

source: 正在更新历史记录
en: Updating history

source: 正在查找附近的 eSheepNext。
en: Looking for near eSheepNext.

source: 正在查询官方额度
en: Checking the official quota

source: 正在校验与重建
en: Validation and reconstruction

source: 正在核对云端数据
en: Checking cloud data

# 正在核对出生前 %lld～%lld 天的母本圈舍
source: 正在核对出生前 %1$lld～%2$lld 天的母本圈舍
en: Checking the dam’s pen %lld–%lld days before birth

source: 正在核对当前同步状态
en: Checking current sync status

source: 正在检查
en: Checking

source: 正在检查 AI 助手配置
en: Checking AI assistant configuration

source: 正在检查…
en: Checking…

source: 正在检查本地数据
en: Checking local data

source: 正在汇总投喂记录
en: Aggregating feeding records

source: 正在汇总设定量与实际投喂
en: Summarizing set amount and actual feeding

source: 正在测试连接
en: Testing connection

source: 正在清理…
en: Cleaning up…

source: 正在生成
en: Generating

source: 正在生成…
en: Generating…

source: 正在生成诊断归档并清理…
en: Generating diagnostic archive and cleaning...

source: 正在确认投喂日期的圈舍存栏
en: Confirming pen herd inventory for feeding date

source: 正在确认该时间有羊的圈舍
en: Pen confirming that there are sheep at this time

source: 正在等待牧场主。
en: Waiting for the rancher.

source: 正在自动恢复启云…
en: Auto-rehabilitating Sending Clouds...

source: 正在获取当前位置
en: Getting current location

source: 正在补拉最新操作
en: Resumed current operation

source: 正在补齐历史数据
en: Completing historical data

source: 正在计算
en: Calculating

source: 正在计算占用空间
en: Calculating space occupied

source: 正在计算增重数据
en: Calculating weight gain data

source: 正在计算繁殖数据
en: Computing reproduction data

source: 正在计算羊只分析
en: Calculating sheep analysis

source: 正在计算羔羊数据
en: Calculating Lamb Data

source: 正在读取云端牧场资料
en: Reading cloud pastures.

source: 正在读取圈舍
en: Loading Pens…

source: 正在读取成员…
en: Reading members...

source: 正在读取时间线
en: Reading timeline

source: 正在读取牧场天气
en: Reading farm weather

source: 正在读取生产记录
en: Reading production record

source: 正在读取系谱
en: Reading pedigree

source: 正在读取羊只档案
en: Reading sheep file

source: 正在读取设备…
en: Reading device...

source: 正在转换、重建历史并对账
en: Converting, reconstructing history and reconciling

source: 正在载入
en: Loading

source: 正在连接
en: Connecting

source: 正在重建临时数据库
en: Rebuilding interim database

source: 正在重建云缓存
en: Rebuilding cloud cache

source: 正在重算羊天、采食和营养
en: Recalculating sheep days, feed intake and nutrition

source: 正在验证…
en: Verifying…

source: 正在验证成员权限和场主签名
en: Validation of member privileges and venue signature

source: 正在验证成员资格并恢复牧场资料…
en: Verifying membership and restoring farm profile...

source: 正在验证登录状态
en: Verifying login status

source: 正在验证账号
en: Verifying account

source: 正常
en: Normal

source: 正常销售
en: Normal sales

source: 正式发布前必须将主体、地址、隐私负责人和邮箱占位符替换为真实信息。
en: The controller, address, privacy owner, and email placeholders must be replaced with real information before official release.

source: 正式日均只计算截至昨天的完整自然日；晚补录转群、离场、投喂或盘槽后会按事实时间重新计算。
en: Official daily averages use only complete calendar days through yesterday. Late entries for transfers, departures, feedings, or bunk readings are recalculated using their actual event times.

source: 正式本地库已经存在相同迁移牧场，但没有完整提交凭据。请先检查本地数据。
en: The same moving pastures already exist in the official local bank, but they are not submitted in full. Please check local data first.

source: 正数增加、负数减少；余额不能小于 0。调整只影响 TMR 成品账，不改动原料库存。
en: Positive Increase, Negative Decrease; Balance cannot be less than 0. The adjustment only affects the TMR finished product account, and does not change the ingredient inventory.

source: 此 iPhone
en: This iPhone
